Библиотека_электронных_документов_демо/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидНоменклатуры</name>
    <type>
      <types>CatalogRef.ВидыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <comment>Полное наименование, например, для печати</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлКартинки</name>
    <type>
      <types>CatalogRef.НоменклатураПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Библиотека_электронных_документов_демо/src/InformationRegisters/Штрихкоды/Штрихкоды.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Штрихкоды</name>
  <dimensions>
    <name>Штрихкод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Владелец</name>
    <type>
      <types>CatalogRef.НоменклатураПоставщиков</types>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Библиотека_электронных_документов_демо/src/Catalogs/Номенклатура/Forms/ФормаВыбораДляСопоставления/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НоменклатураПоставщика.Параметры.УстановитьЗначениеПараметра("Контрагент", Параметры.Контрагент);
	Элементы.Список.ТекущаяСтрока = Параметры.Номенклатура;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	НоменклатураПоставщика.Параметры.УстановитьЗначениеПараметра("Номенклатура", Элемент.ТекущаяСтрока);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПоискПоШтрихкоду(Команда)
	
	Если Элементы.ПоискПоШтрихкоду.Пометка Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "Ссылка");
		Элементы.ПоискПоШтрихкоду.Пометка = Ложь;
		Элементы.СписокКонтекстноеМенюПоискПоШтрихкоду.Пометка = Ложь;
	Иначе
		Оповещение = Новый ОписаниеОповещения("ПоискПоШтрихкодуЗавершение", ЭтотОбъект);
		ПоказатьВводСтроки(Оповещение, "", НСтр("ru = 'Введите штрихкод'"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПоискПоШтрихкодуЗавершение(ШтрихКод, ДополнительныеПараметры) Экспорт
	
	Если ШтрихКод = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НоменклатураПоШтрихкоду = НайтиНоменклатуруПоШтрихкоду(ШтрихКод);
	
	Если НоменклатураПоШтрихкоду = Неопределено Тогда
		
		// ЭлектронноеВзаимодействие.РаботаСНоменклатурой
		Если РаботаСНоменклатуройКлиент.ДоступенФункционалПодсистемы() Тогда
			РаботаСНоменклатуройКлиент.НайтиНоменклатуруПоШтрихкодуВСервисе(ШтрихКод);
		Иначе
			ПоказатьОповещениеПользователя(
				НСтр("ru = 'Номенклатура не найдена'"),,
				СтрШаблон(НСтр("ru = 'По штрихкоду %1 номенклатура не найдена.'"), ШтрихКод),,
				СтатусОповещенияПользователя.Информация);
		КонецЕсли;
		// Конец ЭлектронноеВзаимодействие.РаботаСНоменклатурой
		
	Иначе
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
			Список, "Ссылка", НоменклатураПоШтрихкоду, ВидСравненияКомпоновкиДанных.ВСписке);
		Элементы.ПоискПоШтрихкоду.Пометка = Истина;
		Элементы.СписокКонтекстноеМенюПоискПоШтрихкоду.Пометка = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиНоменклатуруПоШтрихкоду(ШтрихКод)
	
	Возврат РегистрыСведений.Штрихкоды.НайтиНоменклатуруПоШтрихкоду(ШтрихКод);
	
КонецФункции

#КонецОбласти
